# Программа получает на вход список из целых чисел. Ваша задача найти сумму списка.


my_list = list(map(int,input().split()))
print(sum(my_list))
