# Программа получает на вход список целых чисел и ваша задача вывести второй элемент этого списка.

# Гарантируется, что список будет состоять не менее чем из трех элементов.


a = list(map(int, input().split()))
print(a[1])
