# Напишите программу, которая считывает с клавиатуры слово (или фразу, неважно), после чего вывести данную строку,
# увеличенную по длине  в 3 раза.


a = str(input())
print(a*3)