# Напишите программу, которая сначала считывает три фразы по очереди, а потом воспроизводит их в обратной последовательности,
# каждую на отдельной строчке.


a = str(input())
b = str(input())
c = str(input())
print(c)
print(b)
print(a)