# Напишите программу, которая напечатает строку, состоящую из 777 букв "W".


a = 'W'
print(a*777)