# Напишите программу, которая сначала считывает две фразы по очереди, а потом воспроизводит их в той же последовательности,
# каждую на отдельной строчке.


a = str(input())
b = str(input())
print(a)
print(b)