# Напишите программу, которая считывает с клавиатуры фразу и выводит на экран количество символ, которое содержалось в ней,
# учитывая все знаки препинания и пунктуации.


a = str(input())
print(len(a))