# Напишите программу, которая считывает с клавиатуры слово (или фразу, неважно),
# после чего выводит это же слово четыре раза на одной строке, разделяя их пробелами.


a = str(input())
print(a,a,a,a,sep=' ')