# Напишите программу, которая принимает на вход два целых числа в одну строку и выводит на экран их сумму.


a,b = map(int, input().split())
sum = a + b
print(sum)
