# Напишите программу, которая принимает на вход возраст человека (количество полных лет) и выводит сколько лет ему исполнится
# в следующем году.


a = int(input())
print(a + 1)
