# Напишите программу, которая распечатает все натуральные числа от 1000 до 2000 включительно.

# Каждое число следует выводить на отдельной строчке как в примере ниже.


t = 1000
while t <= 2000:
    print(t)
    t = t + 1
