# n школьников делят k яблок поровну, неделящийся остаток остается в корзинке. Сколько яблок достанется каждому школьнику?
# Программа получает на вход сперва число n, а потом k.


n = int(input())
k = int(input())
v = k//n
print(v)
