# Дано целое положительное число, ваша задача вывести разряд сотен этого числа.


a = int(input())
b = a//100%10
print(b)
