# Программа получает на вход строку. Ваша задача вывести все символы этой строки, которые имеют нечетные индексы.


a = str(input())
print(a[1::2])