# Программа получает на вход строку.

# Выведите каждый третий символ строки в обратном порядке, начиная с последнего.


a = str(input())
print(a[::-3])