# Программа получает на вход строку и ваша задача вывести первый элемент данной строки.


a = str(input())
print(a[0])