# Программа получает на вход строку и ваша задача вывести первые 4 символа этой строки.

# Гарантируется, что вводится будет строка длиной не менее 4 символов.


a = str(input())
print(a[0:4])