# Программа получает на вход строку. Ваша задача развернуть строку и вывести ее на экран.


a = str(input())
print(a[::-1])