# Программа получает на вход строку и ваша задача вывести последний символ этой строки.


a = str(input())
print(a[-1])