# Программа получает на вход строку. Ваша задача вывести все символы этой строки, которые имеют четные индексы.


a = str(input())
print(a[::2])

