# Дано целое число n. Выведите следующее за ним четное число.

# Задачу необходимо решить целочисленными операциями без использования условных операторов и\или циклов.


a = int(input())
print(a+2-a%2)
