# Программа получает на вход фразу, состоящую из нескольких слов, разделенных пробелом.

# Ваша задача заменить все пробелы запятыми и вывести полученную строку.


a = str(input())
n = a.replace(' ',',')
print(n)