
# Создайте этот прекрасный рисунок.

# Старайтесь для переноса строк использовать экранированный символ "\n".


a = '/\_/\ \n>^,^<\n / \ \n(|_|)_/'
print(a)